dji-sdk/Payload-SDK/samples/sample_c/platform/rtos_freertos/stm32f4_discovery/middlewares/ST/STM32_USB_Host_Library/Class/CDC/Src/usbh_cdc.c
/**
  ******************************************************************************
  * @file    usbh_cdc.c
  * @author  MCD Application Team
  * @brief   This file is the CDC Layer Handlers for USB Host CDC class.
  *
  *  @verbatim
  *
  *          ===================================================================
  *                                CDC Class Driver Description
  *          ===================================================================
  *           This driver manages the "Universal Serial Bus Class Definitions for Communications Devices
  *           Revision 1.2 November 16, 2007" and the sub-protocol specification of "Universal Serial Bus
  *           Communications Class Subclass Specification for PSTN Devices Revision 1.2 February 9, 2007"
  *           This driver implements the following aspects of the specification:
  *             - Device descriptor management
  *             - Configuration descriptor management
  *             - Enumeration as CDC device with 2 data endpoints (IN and OUT) and 1 command endpoint (IN)
  *             - Requests management (as described in section 6.2 in specification)
  *             - Abstract Control Model compliant
  *             - Union Functional collection (using 1 IN endpoint for control)
  *             - Data interface class
  *
  *  @endverbatim
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2015 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                      www.st.com/SLA0044
  *
  ******************************************************************************
  */

/* BSPDependencies
- "stm32xxxxx_{eval}{discovery}{nucleo_144}.c"
- "stm32xxxxx_{eval}{discovery}_io.c"
- "stm32xxxxx_{eval}{discovery}{adafruit}_sd.c"
- "stm32xxxxx_{eval}{discovery}{adafruit}_lcd.c"
- "stm32xxxxx_{eval}{discovery}_sdram.c"
EndBSPDependencies */

#define DJI_CDC_CTRL_BINTERFACE_NUMBER 4
#define DJI_CDC_DATA_BINTERFACE_NUMBER 5
#define DJI_CDC_DATA_ALT_SETTINGS      0

/* Includes ------------------------------------------------------------------*/
#include "usbh_cdc.h"

/** @addtogroup USBH_LIB
* @{
*/

/** @addtogroup USBH_CLASS
* @{
*/

/** @addtogroup USBH_CDC_CLASS
* @{
*/

/** @defgroup USBH_CDC_CORE
* @brief    This file includes CDC Layer Handlers for USB Host CDC class.
* @{
*/

/** @defgroup USBH_CDC_CORE_Private_TypesDefinitions
* @{
*/
/**
* @}
*/


/** @defgroup USBH_CDC_CORE_Private_Defines
* @{
*/
#define USBH_CDC_BUFFER_SIZE                 1024
/**
* @}
*/


/** @defgroup USBH_CDC_CORE_Private_Macros
* @{
*/
/**
* @}
*/


/** @defgroup USBH_CDC_CORE_Private_Variables
* @{
*/
/**
* @}
*/


/** @defgroup USBH_CDC_CORE_Private_FunctionPrototypes
* @{
*/

static USBH_StatusTypeDef USBH_CDC_InterfaceInit(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_CDC_InterfaceDeInit(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_CDC_Process(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_CDC_SOFProcess(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef USBH_CDC_ClassRequest(USBH_HandleTypeDef *phost);

static USBH_StatusTypeDef GetLineCoding(USBH_HandleTypeDef *phost,
                                        CDC_LineCodingTypeDef *linecoding);

static USBH_StatusTypeDef SetLineCoding(USBH_HandleTypeDef *phost,
                                        CDC_LineCodingTypeDef *linecoding);

static void CDC_ProcessTransmission(USBH_HandleTypeDef *phost);

static void CDC_ProcessReception(USBH_HandleTypeDef *phost);

USBH_ClassTypeDef CDC_Class =
    {
        "DJI_CDC",
        DJI_CDC_CLASS,
        USBH_CDC_InterfaceInit,
        USBH_CDC_InterfaceDeInit,
        USBH_CDC_ClassRequest,
        USBH_CDC_Process,
        USBH_CDC_SOFProcess,
        NULL,
    };
/**
* @}
*/
/* USER CODE BEGIN Data queue init */
#define ACM_RECV_BUFFER_SIZE 1024
#define ACM_SEND_BUFFER_SIZE 2048

QueueHandle_t ACMDataRecvQueue;
QueueHandle_t ACMDataSendQueue;
#if USE_USB_HOST_UART
CCMRAM static uint8_t cdcBuff[1024];
#endif

void USBH_CDC_DataQueueInit(void)
{
    ACMDataRecvQueue = xQueueCreate(ACM_RECV_BUFFER_SIZE, sizeof(uint8_t));
    ACMDataSendQueue = xQueueCreate(ACM_SEND_BUFFER_SIZE, sizeof(uint8_t));
}

void USBH_CDC_WriteData(const uint8_t *buf, uint32_t len, uint32_t *realLen)
{
#ifdef USE_USB_HOST_UART
    *realLen = len;
    while (len--) {
        xQueueSend(ACMDataSendQueue, buf++, 0);
    }
#endif
}

void USBH_CDC_ReadData(uint8_t *buf, uint32_t len, uint32_t *realLen)
{
#ifdef USE_USB_HOST_UART
    uint8_t recvByte;
    *realLen = 0;
    for (int cnt = 0; cnt < len; cnt++) {
        if (xQueueReceive(ACMDataRecvQueue, &recvByte, 0)) {
            buf[*realLen] = recvByte;
            (*realLen)++;
        } else {
            break;
        }
    }
#endif
}

/* USER CODE END Data queue init */

/** @defgroup USBH_CDC_CORE_Private_Functions
* @{
*/

/**
  * @brief  USBH_CDC_InterfaceInit
  *         The function init the CDC class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_CDC_InterfaceInit(USBH_HandleTypeDef *phost)
{

    USBH_StatusTypeDef status;
    uint8_t interface;
    CDC_HandleTypeDef *CDC_Handle;

    interface = USBH_FindInterface(phost, COMMUNICATION_INTERFACE_CLASS_CODE,
                                   ABSTRACT_CONTROL_MODEL, COMMON_AT_COMMAND);
    USBH_DbgLog("DJI USB ctrl interface : %d", interface);
    if ((interface == 0xFFU) || (interface >= USBH_MAX_NUM_INTERFACES)) /* No Valid Interface */
    {
        USBH_DbgLog("Cannot Find the interface for Communication Interface Class, name:%s", phost->pActiveClass->Name);
        return USBH_FAIL;
    }

    status = USBH_SelectInterface(phost, interface);

    if (status != USBH_OK) {
        return USBH_FAIL;
    }

