dji-sdk/Payload-SDK/samples/sample_c/platform/rtos_freertos/stm32f4_discovery/middlewares/ST/STM32_USB_Host_Library/Class/CDC/Src/usbh_cdc.c
    phost->pActiveClass->pData = (CDC_HandleTypeDef *) USBH_malloc(sizeof(CDC_HandleTypeDef));
    CDC_Handle = (CDC_HandleTypeDef *) phost->pActiveClass->pData;

    if (CDC_Handle == NULL) {
        USBH_DbgLog("Cannot allocate memory for CDC Handle");
        return USBH_FAIL;
    }

    /* Initialize cdc handler */
    USBH_memset(CDC_Handle, 0, sizeof(CDC_HandleTypeDef));

    /*Collect the notification endpoint address and length*/
    if (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress & 0x80U) {
        CDC_Handle->CommItf.NotifEp = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress;
        CDC_Handle->CommItf.NotifEpSize = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].wMaxPacketSize;
    }

    /*Allocate the length for host channel number in*/
    CDC_Handle->CommItf.NotifPipe = USBH_AllocPipe(phost, CDC_Handle->CommItf.NotifEp);

    /* Open pipe for Notification endpoint */
    USBH_OpenPipe(phost, CDC_Handle->CommItf.NotifPipe, CDC_Handle->CommItf.NotifEp,
                  phost->device.address, phost->device.speed, USB_EP_TYPE_INTR,
                  CDC_Handle->CommItf.NotifEpSize);

    USBH_LL_SetToggle(phost, CDC_Handle->CommItf.NotifPipe, 0U);

    /*
    interface = USBH_FindInterface(phost, DATA_INTERFACE_CLASS_CODE,
                                   RESERVED, NO_CLASS_SPECIFIC_PROTOCOL_CODE);
    */
    interface = USBH_FindInterfaceIndex(phost, DJI_CDC_DATA_BINTERFACE_NUMBER, DJI_CDC_DATA_ALT_SETTINGS);
    if ((interface == 0xFFU) || (interface >= USBH_MAX_NUM_INTERFACES)) /* No Valid Interface */
    {
        USBH_DbgLog("Cannot Find the interface for Data Interface Class, name:%s", phost->pActiveClass->Name);
        return USBH_FAIL;
    }

    /*Collect the class specific endpoint address and length*/
    if (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress & 0x80U) {
        CDC_Handle->DataItf.InEp = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress;
        CDC_Handle->DataItf.InEpSize = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].wMaxPacketSize;
    } else {
        CDC_Handle->DataItf.OutEp = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].bEndpointAddress;
        CDC_Handle->DataItf.OutEpSize = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[0].wMaxPacketSize;
    }

    if (phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[1].bEndpointAddress & 0x80U) {
        CDC_Handle->DataItf.InEp = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[1].bEndpointAddress;
        CDC_Handle->DataItf.InEpSize = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[1].wMaxPacketSize;
    } else {
        CDC_Handle->DataItf.OutEp = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[1].bEndpointAddress;
        CDC_Handle->DataItf.OutEpSize = phost->device.CfgDesc.Itf_Desc[interface].Ep_Desc[1].wMaxPacketSize;
    }

    /*Allocate the length for host channel number out*/
    CDC_Handle->DataItf.OutPipe = USBH_AllocPipe(phost, CDC_Handle->DataItf.OutEp);

    /*Allocate the length for host channel number in*/
    CDC_Handle->DataItf.InPipe = USBH_AllocPipe(phost, CDC_Handle->DataItf.InEp);

    /* Open channel for OUT endpoint */
    USBH_OpenPipe(phost, CDC_Handle->DataItf.OutPipe, CDC_Handle->DataItf.OutEp,
                  phost->device.address, phost->device.speed, USB_EP_TYPE_BULK,
                  CDC_Handle->DataItf.OutEpSize);

    /* Open channel for IN endpoint */
    USBH_OpenPipe(phost, CDC_Handle->DataItf.InPipe, CDC_Handle->DataItf.InEp,
                  phost->device.address, phost->device.speed, USB_EP_TYPE_BULK,
                  CDC_Handle->DataItf.InEpSize);

    CDC_Handle->state = CDC_IDLE_STATE;

    USBH_LL_SetToggle(phost, CDC_Handle->DataItf.OutPipe, 0U);
    USBH_LL_SetToggle(phost, CDC_Handle->DataItf.InPipe, 0U);

    return USBH_OK;
}


/**
  * @brief  USBH_CDC_InterfaceDeInit
  *         The function DeInit the Pipes used for the CDC class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_CDC_InterfaceDeInit(USBH_HandleTypeDef *phost)
{
    CDC_HandleTypeDef *CDC_Handle = (CDC_HandleTypeDef *) phost->pActiveClass->pData;

    if (CDC_Handle->CommItf.NotifPipe) {
        USBH_ClosePipe(phost, CDC_Handle->CommItf.NotifPipe);
        USBH_FreePipe(phost, CDC_Handle->CommItf.NotifPipe);
        CDC_Handle->CommItf.NotifPipe = 0U;     /* Reset the Channel as Free */
    }

    if (CDC_Handle->DataItf.InPipe) {
        USBH_ClosePipe(phost, CDC_Handle->DataItf.InPipe);
        USBH_FreePipe(phost, CDC_Handle->DataItf.InPipe);
        CDC_Handle->DataItf.InPipe = 0U;     /* Reset the Channel as Free */
    }

    if (CDC_Handle->DataItf.OutPipe) {
        USBH_ClosePipe(phost, CDC_Handle->DataItf.OutPipe);
        USBH_FreePipe(phost, CDC_Handle->DataItf.OutPipe);
        CDC_Handle->DataItf.OutPipe = 0U;    /* Reset the Channel as Free */
    }

    if (phost->pActiveClass->pData) {
        USBH_free(phost->pActiveClass->pData);
        phost->pActiveClass->pData = 0U;
    }

    return USBH_OK;
}

static void CDC_SetInitialValue(USBH_HandleTypeDef *phost)
{
    /*Set the initial value*/
    CDC_HandleTypeDef *CDC_Handle = (CDC_HandleTypeDef *) phost->pActiveClass->pData;
    CDC_Handle->data_rx_state = CDC_IDLE;
    CDC_Handle->data_tx_state = CDC_IDLE;
    CDC_Handle->LineCoding.b.bCharFormat = 0;
    CDC_Handle->LineCoding.b.bDataBits = 8;
    CDC_Handle->LineCoding.b.bParityType = 0;
    CDC_Handle->LineCoding.b.dwDTERate = 921600;
}

/**
  * @brief  USBH_CDC_ClassRequest
  *         The function is responsible for handling Standard requests
  *         for CDC class.
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_CDC_ClassRequest(USBH_HandleTypeDef *phost)
{
    CDC_SetInitialValue(phost);
    phost->pUser(phost, HOST_USER_CLASS_ACTIVE);

    return USBH_OK;

}

/**
  * @brief  USBH_CDC_Process
  *         The function is for managing state machine for CDC data transfers
  * @param  phost: Host handle
  * @retval USBH Status
  */
static USBH_StatusTypeDef USBH_CDC_Process(USBH_HandleTypeDef *phost)
{
    USBH_StatusTypeDef status = USBH_OK;
    CDC_HandleTypeDef *CDC_Handle = (CDC_HandleTypeDef *) phost->pActiveClass->pData;

    if (CDC_Handle->data_rx_state == CDC_IDLE) {
#if USE_USB_HOST_UART
        USBH_CDC_Receive(phost, cdcBuff, sizeof(cdcBuff));
#endif
    }

    if (CDC_Handle->data_tx_state == CDC_IDLE) {
        uint8_t sendByte = 0;
        uint8_t sendBuff[1024] = {0};
        uint32_t sendLen = 0;
        osDelay(5);

        for (int cnt = 0; cnt < sizeof(sendBuff); cnt++) {
            if (xQueueReceive(ACMDataSendQueue, &sendByte, 0)) {
                sendBuff[sendLen++] = sendByte;
            } else {
                break;
            }
        }
        if (sendLen) {
            USBH_CDC_Transmit(phost, sendBuff, sendLen);
        }
    }
    CDC_ProcessTransmission(phost);
    CDC_ProcessReception(phost);

