dji-sdk/Payload-SDK/samples/sample_c/platform/rtos_freertos/stm32f4_discovery/middlewares/ST/STM32_USB_Host_Library/Class/CDC/Src/usbh_cdc.c
            URB_Status = USBH_LL_GetURBState(phost, CDC_Handle->DataItf.OutPipe);

            /* Check the status done for transmission */
            if (URB_Status == USBH_URB_DONE) {
                if (CDC_Handle->TxDataLength > CDC_Handle->DataItf.OutEpSize) {
                    CDC_Handle->TxDataLength -= CDC_Handle->DataItf.OutEpSize;
                    CDC_Handle->pTxData += CDC_Handle->DataItf.OutEpSize;
                } else {
                    CDC_Handle->TxDataLength = 0U;
                }

                if (CDC_Handle->TxDataLength > 0U) {
                    CDC_Handle->data_tx_state = CDC_SEND_DATA;
                } else {
                    CDC_Handle->data_tx_state = CDC_IDLE;
                    USBH_CDC_TransmitCallback(phost);
                }

#if (USBH_USE_OS == 1U)
                phost->os_msg = (uint32_t) USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
                (void) osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
                (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
            } else {
                if (URB_Status == USBH_URB_NOTREADY) {
                    CDC_Handle->data_tx_state = CDC_SEND_DATA;

#if (USBH_USE_OS == 1U)
                    phost->os_msg = (uint32_t) USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
                    (void) osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
                    (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
                }
            }
            break;

        default:
            break;
    }
}

/**
* @brief  This function responsible for reception of data from the device
*  @param  pdev: Selected device
* @retval None
*/

static void CDC_ProcessReception(USBH_HandleTypeDef *phost)
{
    CDC_HandleTypeDef *CDC_Handle = (CDC_HandleTypeDef *) phost->pActiveClass->pData;
    USBH_URBStateTypeDef URB_Status = USBH_URB_IDLE;
    uint32_t length;

    switch (CDC_Handle->data_rx_state) {

        case CDC_RECEIVE_DATA:

            USBH_BulkReceiveData(phost,
                                 CDC_Handle->pRxData,
                                 CDC_Handle->DataItf.InEpSize,
                                 CDC_Handle->DataItf.InPipe);

            CDC_Handle->data_rx_state = CDC_RECEIVE_DATA_WAIT;

            break;

        case CDC_RECEIVE_DATA_WAIT:

            URB_Status = USBH_LL_GetURBState(phost, CDC_Handle->DataItf.InPipe);

            /*Check the status done for reception*/
            if (URB_Status == USBH_URB_DONE) {
                length = USBH_LL_GetLastXferSize(phost, CDC_Handle->DataItf.InPipe);

                if (((CDC_Handle->RxDataLength - length) > 0U) && (length > CDC_Handle->DataItf.InEpSize)) {
                    CDC_Handle->RxDataLength -= length;
                    CDC_Handle->pRxData += length;
                    CDC_Handle->data_rx_state = CDC_RECEIVE_DATA;
                } else {
                    CDC_Handle->data_rx_state = CDC_IDLE;
                    USBH_CDC_ReceiveCallback(phost);
                }

#if (USBH_USE_OS == 1U)
                phost->os_msg = (uint32_t) USBH_CLASS_EVENT;
#if (osCMSIS < 0x20000U)
                (void) osMessagePut(phost->os_event, phost->os_msg, 0U);
#else
                (void)osMessageQueuePut(phost->os_event, &phost->os_msg, 0U, NULL);
#endif
#endif
            }
            break;

        default:
            break;
    }
}

/**
* @brief  The function informs user that data have been received
*  @param  pdev: Selected device
* @retval None
*/
__weak void USBH_CDC_TransmitCallback(USBH_HandleTypeDef *phost)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(phost);
}

/**
* @brief  The function informs user that data have been sent
*  @param  pdev: Selected device
* @retval None
*/
__weak void USBH_CDC_ReceiveCallback(USBH_HandleTypeDef *phost)
{
    CDC_HandleTypeDef *CDC_Handle = (CDC_HandleTypeDef *) phost->pActiveClass->pData;
    int dataSize = USBH_CDC_GetLastReceivedDataSize(phost);

    for (int i = 0; i < dataSize; i++) {
        xQueueSend(ACMDataRecvQueue, CDC_Handle->pRxData + i, (TickType_t) 0);
    }

    osDelay(1);
}

/**
* @brief  The function informs user that Settings have been changed
*  @param  pdev: Selected device
* @retval None
*/
__weak void USBH_CDC_LineCodingChanged(USBH_HandleTypeDef *phost)
{
    /* Prevent unused argument(s) compilation warning */
    UNUSED(phost);
}

/**
* @}
*/

/**
* @}
*/

/**
* @}
*/


/**
* @}
*/


/**
* @}
*/

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
